CSI API ETABS v1

# cSapModelPropMaterial Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropMaterial PropMaterial { get; }

    ReadOnly Property PropMaterial As cPropMaterial
    	Get

    Dim instance As cSapModel
    Dim value As cPropMaterial

    value = instance.PropMaterial

    property cPropMaterial^ PropMaterial {
    	cPropMaterial^ get ();
    }

    abstract PropMaterial : cPropMaterial with get

#### Property Value

Type: cPropMaterial

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com